import math

P1 = 0.88
P2 = 0.14
P3 = 0.93
P4 = 0.04
P5 = 0.98
P6 = 0.56
P7 = 0.59
P8 = 0.64


def lab2(P1, P2, P3, P4, P5, P6, P7, P8):
    R12 = 1.0 - (1 - P1) * (1 - P2)
    R13 = 1 - (1 - P1) * (1 - P3)
    R67 = 1 - (1 - P6) * (1 - P7)
    R23 = 1 - (1 - P2) * (1 - P3)
    R68 = 1 - (1 - P6) * (1 - P8)
    R78 = 1 - (1 - P7) * (1 - P8)

    S1 = R13 * P4 * R67
    S2 = R23 * P5 * R68

    S12 = 1 - (1 - S1) * (1 - S2)

    T1 = R12 * S12 * R78
    return T1


# print("P=", T1)

time = 2167
K_res = 3
K_roz = 2
 # Параметры системы
P_sys = lab2(P1, P2, P3, P4, P5, P6, P7, P8)
Q_sys = 1 - P_sys
T_sys = -time / math.log(P_sys, math.e)

#Заг ненав
Q_res = Q_sys / math.factorial(K_res + 1)
P_res = 1 - Q_res
T_res = -time / math.log(P_res, math.e)

G_q = Q_res / Q_sys
G_p = P_res / P_sys
G_t = T_res / T_sys



#Розп нав
Q_res1 = (1 - P1) ** (K_roz + 1)
Q_res2 = (1 - P2) ** (K_roz + 1)
Q_res3 = (1 - P3) ** (K_roz + 1)
Q_res4 = (1 - P4) ** (K_roz + 1)
Q_res5 = (1 - P5) ** (K_roz + 1)
Q_res6 = (1 - P6) ** (K_roz + 1)
Q_res7 = (1 - P7) ** (K_roz + 1)
Q_res8 = (1 - P8) ** (K_roz + 1)

P_res1 = 1 - Q_res1
P_res2 = 1 - Q_res2
P_res3 = 1 - Q_res3
P_res4 = 1 - Q_res4
P_res5 = 1 - Q_res5
P_res6 = 1 - Q_res6
P_res7 = 1 - Q_res7
P_res8 = 1 - Q_res8


P_roz = lab2(P_res1, P_res2, P_res3, P_res4, P_res5, P_res6, P_res7, P_res8)
Q_roz = 1 - P_roz
T_roz = -time / math.log(P_roz, math.e)
G_roz_q = Q_roz / Q_sys
G_roz_p = P_roz / P_sys
G_roz_t = T_roz / T_sys

print("Базова імовірність безвідмовної роботи = {}\n"
      "Базова імовірність відмови = {}\n"
      "Базовий середній наробіток на відмову = {}\n".format(P_sys, Q_sys, T_sys))

print("Імовірність безвідмовної роботи системи з ненавантаженим загальним резервуванням = {}\n"
      "Імовірність відмови системи з ненавантаженим загальним резервуванням = {}\n"
      "Середній час роботи системи з ненавантаженим загальним резервуванням = {}".format(P_res, Q_res, T_res))
print("Виграш системи з ненавантаженим загальним резервуванням по імовірності безвідмовної роботи = {}\n"
      "Виграш системи з ненавантаженим загальним резервуванням по імовірності відмови = {}\n"
      "Виграш системи з ненавантаженим загальним резервуванням по середньому часу роботи = {}\n".format(G_p, G_q, G_t))


print("Імовірність безвідмовної роботи системи з навантаженим роздільним резервуванням = {}\n"
      "Імовірність відмови системи з навантаженим роздільним резервуванням = {}\n"
      "Середній час роботи системи з навантаженим роздільним резервуванням = {}".format(P_roz, Q_roz, T_roz))
print("Виграш системи з навантаженим роздільним резервуванням по імовірності безвідмовної роботи = {}\n"
      "Виграш системи з навантаженим роздільним резервуванням по імовірності відмови = {}\n"
      "Виграш системи з навантаженим роздільним резервуванням по середньому часу роботи = {}\n".format(G_roz_p, G_roz_q, G_roz_t))
